-- MySQL dump 10.13  Distrib 8.0.41, for Win64 (x86_64)
--
-- Host: 192.168.0.159    Database: healthchi
-- ------------------------------------------------------
-- Server version	8.0.41

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `menu`
--

DROP TABLE IF EXISTS `menu`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `menu` (
  `M_ID` int NOT NULL AUTO_INCREMENT,
  `M_MENU` varchar(30) NOT NULL,
  `M_CAL` int NOT NULL,
  `M_CLASS` varchar(12) NOT NULL,
  `M_MATERIAL` varchar(100) NOT NULL,
  `M_EXPLAIN` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`M_ID`)
) ENGINE=InnoDB AUTO_INCREMENT=270 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `menu`
--

LOCK TABLES `menu` WRITE;
/*!40000 ALTER TABLE `menu` DISABLE KEYS */;
INSERT INTO `menu` VALUES (1,'ご飯　軽盛り（130g）',203,'主食','はくまい　ごはん　こめ','1食あたり'),(2,'ご飯　普通盛り（200g）',312,'主食','はくまい　ごはん　こめ','1食あたり'),(3,'ご飯　大盛り（250g）',390,'主食','はくまい　ごはん　こめ','1食あたり'),(4,'食パン1枚（6枚切り）',154,'主食','パン','1食あたり'),(5,'食パン1枚（8枚切り）',114,'主食','パン','1食あたり'),(6,'フランスパン（3切）',217,'主食','パン','1食あたり'),(7,'クルミパン',169,'主食','パン','1食あたり'),(8,'あんパン',274,'主食','パン','1食あたり'),(9,'カレーパン',353,'主食','パン','1食あたり'),(10,'メロンパン',335,'主食','パン','1食あたり'),(11,'親子丼',518,'主食','たまご　とりにく　たまねぎ　ごはん','1食あたり'),(12,'牛丼',495,'主食','ぎゅうにく　たまねぎ　ごはん','1食あたり'),(13,'うな重',712,'主食','うなぎ','1食あたり'),(14,'アジの塩焼き',111,'おかず','あじ','1食あたり'),(15,'ぶりの塩焼き',224,'おかず','ぶり','1食あたり'),(16,'天ぷらそば',485,'主食','そば　てんぷら　ねぎ','1食あたり'),(17,'ざるそば',317,'主食','そば','1食あたり'),(18,'かけそば',371,'主食','そば','1食あたり'),(19,'きつねうどん',444,'主食','うどん　あげ　ねぎ','1食あたり'),(20,'月見うどん',374,'主食','うどん　たまご','1食あたり'),(21,'お好み焼き',326,'主食','きゃべつ　ぶたにく　いか　こむぎこ','1食あたり'),(22,'ヒレカツ（小3個）',569,'おかず','ぶたにく　ぱんこ','1食あたり'),(23,'ロースかつ',493,'おかず','ぶたにく　ぱんこ','1食あたり'),(24,'カキフライ（5個）',310,'おかず','かき　ぱんこ','1食あたり'),(25,'青菜の白和え',96,'おかず','ほうれんそう　こまつな　とうふ','1椀あたり'),(26,'インゲンのごまあえ',39,'おかず','いんげん　ごま','1椀あたり'),(27,'豚汁',230,'おかず','ぶたにく　ごぼう　さといも　にんじん　とうふ　だいこん','1椀あたり'),(28,'切り干し大根の煮物',67,'おかず','だいこん　きりぼしだいこん　あげ','1椀あたり'),(29,'きんぴらごぼう',45,'おかず','ごぼう　にんじん　ごま','1椀あたり'),(30,'筑前煮',131,'おかず','とりにく　にんじん　ごぼう　しいたけ','1食あたり'),(31,'肉じゃが',166,'おかず','じゃがいも　にんじん　ぎゅうにく　こんにゃく','1食あたり'),(32,'ひじき煮',38,'おかず','ひじき　にんじん　あげ','1椀あたり'),(33,'からあげ（3個）',292,'おかず','とりにく　','1食あたり'),(34,'だし巻き卵',93,'おかず','たまご　だし','1椀あたり'),(35,'ぬか漬け（かぶ）',9,'おかず','かぶ　ぬか','1椀あたり'),(36,'ミートソーススパゲッティ',560,'おかず','あいびきにく　トマト　たまねぎ　パスタ','1食あたり'),(37,'えびグラタン',294,'おかず','ぎゅうにゅう　えび　こむぎこ　マカロニ','1食あたり'),(38,'ハンバーガー',330,'おかず','パン　あいびきにく　レタス','1食あたり'),(39,'チーズバーガー',380,'主食','パン　あいびきにく　レタス　チーズ','1食あたり'),(40,'フライドポテト（ケチャップつき)',291,'おかず','じゃがいも　トマト','1皿あたり'),(41,'ビーフカレー',667,'主食','ぎゅうにく　カレー　ごはん','1食あたり'),(42,'チキンカレー',666,'主食','とりにく　カレー　ごはん','1食あたり'),(43,'カツカレー',996,'主食','ぶたにく　カレー　ごはん','1食あたり'),(44,'えびピラフ',384,'主食','えび　ごはん　コーン　たまねぎ　にんじん　バター','1食あたり'),(45,'ハンバーグ',266,'おかず','あいびきにく　たまご　ぱんこ','1食あたり'),(46,'和風ハンバーグ',289,'おかず','あいびきにく　たまご　ぱんこ　だいこん','1食あたり'),(47,'ハンバーグ （デミグラスソース）',287,'おかず','あいびきにく　たまご　ぱんこ','1食あたり'),(48,'リブロースステーキ',855,'おかず','ぎゅうにく','1食あたり'),(49,'ヒレステーキ',345,'おかず','ぎゅうにく','1食あたり'),(50,'チキンソテー',455,'おかず','とりにく','1食あたり'),(51,'カニクリームコロッケ',393,'おかず','ぎゅうにゅう　かに　ぱんこ','1食あたり'),(52,'チキンシチュー',324,'おかず','とりにく　にんじん　じゃがいも　ぎゅうにゅう','1食あたり'),(53,'ビーフシチュー',477,'おかず','ぎゅうにく　にんじん　デミグラスソース','1食あたり'),(54,'コーンクリームスープ',110,'おかず','ぎゅうにゅう　コーン','1椀あたり'),(55,'えびフライ',236,'おかず','えび　ぱんこ','1食あたり'),(56,'麻婆豆腐',187,'おかず','とうふ　ぶたひきにく　ねぎ　にんにく　しょうが','1食あたり'),(57,'チャーハン',556,'おかず','ごはん　たまご　ぶたにく　','1食あたり'),(58,'酢豚',140,'おかず','ぶたにく　にんじん　たまねぎ　ぴーまん','1食あたり'),(59,'餃子（6個）',270,'おかず','ぶたひきにく　きゃべつ　はくさい　にら　しょうが','1食あたり'),(60,'しゅうまい（6個）',393,'おかず','ぶたにく　しゅうまいのかわ　グリンピース','1食あたり'),(61,'春巻き（2本）',157,'おかず','かわ　たけのこ　ぶたにく　しいたけ　はるさめ　ニラ　にんじん','1食あたり'),(62,'中華ちまき',144,'おかず','もちごめ　ぶたにく　たけのこ　にんじん　しいたけ　あんず','1食あたり'),(63,'肉まん',273,'おかず','ぶたひきにく　ねぎ　しょうが','1食あたり'),(64,'もやしのナムル',48,'おかず','もやし　ごまあぶら','1椀あたり'),(65,'キムチ（白菜）',12,'おかず','はくさい　とうがらし','1椀あたり'),(66,'ポタージュ(濃いめ)',274,'おかず','コーン　牛乳','1椀あたり'),(67,'クラムチャウダー',204,'おかず','ぎゅうにゅう　あさり　ベーコン　たまねぎ　コーン','1椀あたり'),(68,'ミネストローネ',148,'おかず','トマト　にんじん　たまねぎ　ベーコン','1椀あたり'),(69,'野菜スープ（和風）',90,'おかず','ほうれんそう　たまねぎ　たまご','1椀あたり'),(70,'コンソメスープ',8,'おかず','たまねぎ　コンソメ','1椀あたり'),(71,'ふかひれスープ',78,'おかず','ふかひれ　たまご','1椀あたり'),(72,'野菜スープ（中華）',95,'おかず','たまねぎ　こまつな　たまご','1椀あたり'),(73,'玉子スープ',72,'おかず','たまご','1椀あたり'),(74,'わかめスープ',36,'おかず','わかめ','1椀あたり'),(75,'中華スープ',16,'おかず','ちゅうかだし','1椀あたり'),(76,'けんちん汁',160,'おかず','ふたにく　にんじん　ごぼう　とうふ','1椀あたり'),(77,'味噌汁(具なし)',41,'おかず','とうふ　みそ　わかめ　ねぎ','1椀あたり'),(78,'お吸物(具なし)',10,'おかず','のり　だし','1椀あたり'),(79,'アイスクリーム',178,'おやつ','ぎゅうにゅう　さとう','100ｇあたり'),(80,'レアチーズケーキ',349,'おやつ','チーズ　れもん　ヨーグルト','100ｇあたり'),(81,'チーズケーキ',299,'おやつ','こむぎこ　クリームチーズ　れもん','100ｇあたり'),(82,'ショートケーキ',318,'おやつ','こむぎこ　イチゴ　さとう','100ｇあたり'),(83,'プリン',126,'おやつ','たまご　ぎゅうにゅう　さとう','100ｇあたり'),(84,'オレンジゼリー',70,'おやつ','オレンジ　ゼリー','100ｇあたり'),(85,'コーヒーゼリー',45,'おやつ','コーヒー　ゼラチン','100ｇあたり'),(86,'ミルクゼリー',110,'おやつ','ぎゅうにゅう　ゼラチン','100ｇあたり'),(88,'ババロア',218,'おやつ','ぎゅうにゅう　ぜらちん','100ｇあたり'),(89,'シュークリーム',245,'おやつ','たまご　ぎゅうにゅう　こむぎこ','100ｇあたり'),(90,'ドーナツ',375,'おやつ','さとう　こむぎこ','100ｇあたり'),(95,'アップルパイ',304,'おやつ','りんご　ぱい　さとう','100ｇあたり'),(96,'ミートパイ',414,'おやつ','ひきにく　とまと　ぱい','100ｇあたり'),(98,'ホットケーキ',261,'主食','こむぎこ　はちみつ　ぎゅうにゅう','100ｇあたり'),(99,'ワッフル',256,'主食','こむぎこ　ぎゅうにゅう','100ｇあたり'),(101,'あんパン',280,'主食','あんこ　こむぎこ','100ｇあたり'),(102,'ジャムパン',297,'おやつ','じゃむ　こむぎこ','100ｇあたり'),(103,'チョココロネ',308,'おやつ','ちょこ　こむぎこ','100ｇあたり'),(104,'ウエハース',454,'おやつ','こむぎこ','100ｇあたり'),(105,'クラッカー',492,'おやつ','こむぎこ　しお','100ｇあたり'),(107,'サブレ',465,'おやつ','こむぎこ　さとう','100ｇあたり'),(109,'ビスケット',432,'おやつ','こむぎこ　さとう','100ｇあたり'),(112,'コーンスナック',526,'おやつ','こーん','100ｇあたり'),(113,'ポテトチップス',554,'おやつ','じゃがいも　しお','100ｇあたり'),(115,'キャラメル',433,'おやつ','さとう','100ｇあたり'),(116,'ラムネ',396,'おやつ','かたくりこ','100ｇあたり'),(118,'ゼリービーンズ',362,'おやつ','さとう','100ｇあたり'),(121,'バタースコッチ',423,'おやつ','さとう　ばたー　こむぎこ','100ｇあたり'),(123,'マシュマロ',326,'おやつ','さとう　ぜらちん','100ｇあたり'),(126,'チョコレート',557,'おやつ','ちょこれーと','100ｇあたり'),(128,'ガム',388,'おやつ','がむ','100ｇあたり'),(135,'今川焼き',222,'おやつ','こむぎこ　あんこ','100ｇあたり：参考1個90gの場合200kcal'),(136,'ういろう',183,'おやつ','こめこ　さとう','100ｇあたり：参考1切れ40gの場合73kcal'),(139,'カステラ',319,'おやつ','こむぎこ　たまご　さとう','100ｇあたり：参考1切れ50gの場合160kcal'),(142,'団子',304,'おやつ','こめこ','100ｇあたり'),(153,'大福もち',235,'おやつ','こめこ　あんこ','100ｇあたり：参考1個80gの場合188kcal'),(154,'タルト',293,'おやつ','さとう　こむぎこ','100ｇあたり：参考1切れ40gあたり117kcal'),(157,'どら焼',284,'おやつ','あんこ　こむぎこ','100ｇあたり：参考1個100gあたり284kcal'),(166,'最中',285,'おやつ','あんこ　こむぎこ','100ｇあたり：参考45gあたり114kcal'),(169,'水ようかん',171,'おやつ','かんてん　あずき','100ｇあたり'),(171,'牛乳',122,'その他','ぎゅうにゅう','200㏄あたり'),(172,'豆乳',118,'その他','だいず','200㏄あたり'),(174,'清酒',206,'その他','こめ　あるこーる','200㏄あたり'),(178,'ビール',138,'その他','あるこーる','1缶(350ml)あたり'),(181,'発泡酒',150,'その他','びーる','1缶(350ml)あたり'),(182,'白ワイン',75,'その他','ぶどう　あるこーる','1杯(100㏄)あたり'),(183,'赤ワイン',77,'その他','ぶどう　あるこーる','1杯(100㏄)あたり'),(184,'ロゼワイン',77,'その他','ぶどう　あるこーる','1杯(100㏄)あたり'),(185,'紹興酒',127,'その他','あるこーる','1杯(100㏄)あたり'),(186,'焼酎　甲',412,'その他','あるこーる','200㏄あたり'),(187,'焼酎　乙',292,'その他','あるこーる','200㏄あたり'),(188,'ウイスキー',474,'その他','あるこーる','200㏄あたり'),(189,'ブランデー',474,'その他','あるこーる','200㏄あたり'),(190,'ウォッカ',240,'その他','あるこーる','100㏄あたり'),(191,'ジン',284,'その他','あるこーる','100㏄あたり'),(192,'ラム',240,'その他','あるこーる','100㏄あたり'),(194,'梅酒',312,'その他','うめ　あるこーる','100㏄あたり'),(199,'スイートワイン',133,'その他','ぶどう　あるこーる','100㏄あたり'),(204,'せん茶',4,'その他','ちゃば','200㏄あたり'),(206,'番茶',0,'その他','ちゃば','200㏄あたり'),(207,'ほうじ茶',0,'その他','ちゃば','200㏄あたり'),(208,'玄米茶',0,'その他','ちゃば　げんまい','200㏄あたり'),(209,'ウーロン茶',0,'その他','ちゃば','200㏄あたり'),(210,'紅茶',2,'その他','ちゃば','200㏄あたり'),(211,'コーヒー',8,'その他','こーひー','200㏄あたり'),(212,'コーヒー飲料',76,'その他','さとう　こーひー','200㏄あたり'),(213,'ピュアココア',542,'その他','ここあ','200㏄あたり'),(214,'ミルクココア',824,'その他','ここあ　ぎゅうにゅう','200㏄あたり'),(215,'甘酒',162,'その他','こめ','200㏄あたり'),(216,'昆布茶',196,'その他','こんぶ','200㏄あたり'),(217,'炭酸飲料類）果実飲料類',102,'その他','さとう　たんさん','200㏄あたり'),(218,'コーラ',92,'その他','さとう　たんさん','200㏄あたり'),(219,'サイダー',82,'その他','さとう　たんさん','200㏄あたり'),(220,'あんパン',280,'おやつ','あんこ　こむぎこ','100ｇあたり'),(221,'クリームパン',389,'おやつ','くりーむ　こむぎこ','100ｇあたり'),(222,'ジャムパン',297,'おやつ','じゃむ　こむぎこ','100ｇあたり'),(223,'チョココロネ',308,'おやつ','ちょこ　こむぎこ','100ｇあたり'),(225,'あんず[乾燥]',289,'その他','あんず','100ｇあたり'),(226,'いちご',36,'その他','いちご','100ｇあたり'),(227,'いちじく',55,'その他','いちじく','100ｇあたり'),(228,'いよかん',47,'その他','いよかん','100ｇあたり'),(229,'みかん',45,'その他','みかん','100ｇあたり'),(230,'オレンジ',40,'その他','おれんじ','100ｇあたり'),(231,'ネーブル',47,'その他','ねーぶる','100ｇあたり'),(232,'柿(かき)',61,'その他','かき','100ｇあたり'),(234,'キウイフルーツ',57,'その他','きういふるーつ','100ｇあたり'),(235,'グレープフルーツ',37,'その他','ぐれーぷふるーつ','100ｇあたり'),(236,'さくらんぼ',61,'その他','さくらんぼ','100ｇあたり'),(237,'ざくろ',57,'その他','ざくろ','100ｇあたり'),(238,'すいか',32,'その他','すいか','100ｇあたり'),(240,'すもも',45,'その他','すもも','100ｇあたり'),(242,'梨(なし)',41,'その他','なし','100ｇあたり'),(243,'なつみかん',41,'その他','みかん','100ｇあたり'),(244,'パイナップル',59,'その他','ぱいなっぷる','100ｇあたり'),(245,'はっさく',46,'その他','みかん','100ｇあたり'),(247,'バナナ',88,'その他','ばなな','100ｇあたり'),(248,'パパイア',39,'その他','パパイア','100ｇあたり'),(249,'ぶどう',57,'その他','ぶどう','100ｇあたり'),(251,'ブルーベリー',50,'その他','ぶるーべりー','100ｇあたり'),(252,'マンゴー',65,'その他','まんごー','100ｇあたり'),(253,'ライチ',68,'その他','らいち','100ｇあたり'),(254,'メロン',44,'その他','めろん','100ｇあたり'),(255,'桃',38,'その他','もも','100ｇあたり'),(256,'柚子(ゆず)',58,'その他','ゆず','100ｇあたり'),(258,'ライム',28,'その他','らいむ','100ｇあたり'),(259,'ラズベリー',42,'その他','らずべりー','100ｇあたり'),(260,'りんご',51,'その他','りんご','100ｇあたり'),(261,'レモン',25,'その他','れもん','100ｇあたり'),(262,'オリジナルメニュー',700,'副菜','オリジナル',NULL),(264,'オリジナルメニュー３',900,'おやつ,飲料,くだもの','オリジナル',NULL),(265,'オリジナルメニュー',2000,'スープ','オリジナル',NULL),(267,'ジンギスカンなべ',150,'おかず','ひつじにく、きゃべつ','300ｇあたり'),(268,'天津飯',500,'おかず','たまご　ごはん','200ｇ'),(269,'ガパオライス',400,'主食','ぶたひきにく　ぱくちー','250gあたり');
/*!40000 ALTER TABLE `menu` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-04-30 11:36:18
